Reports/СправкаРасчетКалькуляцияСебестоимостиУправленческийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетКалькуляцияСебестоимостиУправленческийУчет</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/НезавершенноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>НезавершенноеПроизводство</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийНезавершенноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована списанием партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗатратКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеНЗП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппаНЗП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материальные</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчисленияНаСоциальныеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КодыОперацийНезавершенноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>КодыОперацийНезавершенноеПроизводство</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартийВПроизводствоОперативно</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеКоличестваВПроизводствоОперативно</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПрочихЗатратВПроизводство</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратМатериаловИзПроизводстваФикс</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутренниеУслугиНаПроизводство</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиКонтрагентаНаПроизводство</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияНЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНЗПФикс</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНЗПРегламент</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеАдминистративныеРасходы_Регламент</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОбщепроизводственныеРасходы_Регламент</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОтрицЗатратРегламент</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБракВПроизводстве_Регламент</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтрицательныеЗатраты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеНЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеНЗПФикс</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаНЗПФикс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СправкаРасчетКалькуляцияСебестоимостиУправленческийУчет/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

Функция СформироватьТекстЗапроса()
	
	Текст	= "ВЫБРАТЬ
     	  |	Выпуск.ПодразделениеВыпуска КАК Подразделение,
     	  |	Выпуск.НоменклатурнаяГруппаВыпуска КАК НоменклатурнаяГруппа,
     	  |	Выпуск.НоменклатураВыпуска КАК Номенклатура,
     	  |	Выпуск.ХарактеристикаВыпуска КАК Характеристика,
     	  |	Выпуск.СерияВыпуска КАК Серия,
     	  |	Выпуск.ЗаказВыпуска КАК Заказ,
     	  |	Выпуск.КачествоВыпуска КАК Качество,
     	  |	ПрямыеЗатраты.ЗатратыПрямыхЗатрат КАК ПрямыеЗатраты,
     	  |	ВЫБОР КОГДА ЕСТЬNULL(ПрямыеЗатраты.ЗатратыПрямыхЗатрат.ВидЗатрат, ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.Прочие)) = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.Материальные) ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК МатериальныеЗатраты,
     	  |	ПрямыеЗатраты.НоменклатураПрямыхЗатрат КАК НоменклатураПрямыхЗатрат,
     	  |	Брак.ЗатратыБрак КАК ЗатратыБрак,
     	  |	ОбщеПроизводственныеЗатраты.ЗатратыОПЗ КАК ЗатратыОПЗ,
     	  |	ЕСТЬNULL(Выпуск.КоличествоВыпуска, 0) КАК Количество,
     	  |	ЕСТЬNULL(ПрямыеЗатраты.КоличествоПрямыхЗатрат, 0) КАК КоличествоПрямыхЗатрат,
     	  |	ЕСТЬNULL(Выпуск.ОбщаяСуммаВыпуска, 0) КАК ОбщаяСуммаВыпуска,
     	  |	ЕСТЬNULL(Выпуск.СуммаВыпуска, 0) КАК Сумма,
     	  |	ЕСТЬNULL(Выпуск.ОбщийНДСВыпуска, 0) КАК ОбщийНДСВыпуска,
     	  |	ЕСТЬNULL(Выпуск.НДСВыпуска, 0) КАК НДС,
     	  |	ЕСТЬNULL(ПрямыеЗатраты.СуммаПрямыхЗатрат, 0) КАК СуммаПрямыхЗатрат,
     	  |	ЕСТЬNULL(ПрямыеЗатраты.НДСПрямыхЗатрат, 0) КАК НДСПрямыхЗатрат,
     	  |	ЕСТЬNULL(НЗП.НачОст, 0) КАК НачОстНЗП,
     	  |	ЕСТЬNULL(НЗП.КонОст, 0) КАК КонОстНЗП,
     	  |	ЕСТЬNULL(НЗП.НДСНачОст, 0) КАК НДСНачОстНЗП,
     	  |	ЕСТЬNULL(НЗП.НДСКонОст, 0) КАК НДСКонОстНЗП,
     	  |	ЕСТЬNULL(Брак.СуммаБрак, 0) КАК СуммаБрак,
     	  |	ЕСТЬNULL(Брак.НДСБрак, 0) КАК НДСБрак,
     	  |	ЕСТЬNULL(ОбщеПроизводственныеЗатраты.СуммаОПЗ, 0) КАК СуммаОПЗ,
     	  |	ЕСТЬNULL(ОбщеПроизводственныеЗатраты.НДСОПЗ, 0) КАК НДСОПЗ
     	  |ИЗ
     	  |	(ВЫБРАТЬ
     	  |		НЗПОборотыРасход.Подразделение КАК ПодразделениеВыпуска,
     	  |		НЗПОборотыРасход.НоменклатурнаяГруппа КАК НоменклатурнаяГруппаВыпуска,
     	  |		НЗПОборотыРасход.Продукция КАК НоменклатураВыпуска,
		  |		НЗПОборотыРасход.ХарактеристикаПродукции КАК ХарактеристикаВыпуска,
		  |		НЗПОборотыРасход.СерияПродукции КАК СерияВыпуска,
		  |		НЗПОборотыРасход.Заказ КАК ЗаказВыпуска,
		  |		НЗПОборотыРасход.Качество КАК КачествоВыпуска,
     	  |		НЗПОборотыРасход.Стоимость КАК СуммаВыпуска,
     	  |		НЗПОборотыРасход.НДС КАК НДСВыпуска,
     	  |		НЗПОборотыРасход.ПродукцияКоличество КАК КоличествоВыпуска,
     	  |		НЗПОборотыРасход.Стоимость КАК ОбщаяСуммаВыпуска,
     	  |		НЗПОборотыРасход.НДС КАК ОбщийНДСВыпуска
     	  |	ИЗ
		  |      (ВЫБРАТЬ 
		  |			НезавершенноеПроизводство.Подразделение,
		  |			НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |			НезавершенноеПроизводство.Продукция,
		  |			НезавершенноеПроизводство.ХарактеристикаПродукции,
		  |			НезавершенноеПроизводство.СерияПродукции,
		  |			НезавершенноеПроизводство.Заказ,
		  |			НезавершенноеПроизводство.Качество,
		  |			СУММА(НезавершенноеПроизводство.Стоимость) КАК Стоимость,
		  |			СУММА(НезавершенноеПроизводство.НДС) КАК НДС,
		  |			СУММА(НезавершенноеПроизводство.ПродукцияКоличество) КАК ПродукцияКоличество
		  |		ИЗ
		  |			РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
		  |		ГДЕ
		  |			НезавершенноеПроизводство.Период >= &НачДата
		  |			И НезавершенноеПроизводство.Период <= &КонДата
		  |			И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияРасход
		  |//ОТБОРНезавершенноеПроизводство
		  |
		  |		СГРУППИРОВАТЬ ПО
		  |			НезавершенноеПроизводство.Подразделение,
		  |			НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |			НезавершенноеПроизводство.Продукция,
		  |			НезавершенноеПроизводство.ХарактеристикаПродукции,
		  |			НезавершенноеПроизводство.СерияПродукции,
		  |			НезавершенноеПроизводство.Заказ,
		  |			НезавершенноеПроизводство.Качество
		  |	   ) КАК НЗПОборотыРасход
		  | ) КАК Выпуск
     	  |		ЛЕВОЕ СОЕДИНЕНИЕ 
		  |       (ВЫБРАТЬ
     	  |			НЗПОборотыПриходБезОПЗ.Подразделение КАК ПодразделениеПрямыхЗатрат,
     	  |			НЗПОборотыПриходБезОПЗ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппаПрямыхЗатрат,
     	  |			НЗПОборотыПриходБезОПЗ.СтатьяЗатрат КАК ЗатратыПрямыхЗатрат,
     	  |			НЗПОборотыПриходБезОПЗ.НоменклатураЗатрат КАК НоменклатураПрямыхЗатрат,
     	  |			НЗПОборотыПриходБезОПЗ.Стоимость КАК СуммаПрямыхЗатрат,
     	  |			НЗПОборотыПриходБезОПЗ.НДС КАК НДСПрямыхЗатрат,
     	  |			НЗПОборотыПриходБезОПЗ.НоменклатураЗатратКоличество КАК КоличествоПрямыхЗатрат
     	  |		  ИЗ 
		  |      	(ВЫБРАТЬ 
		  |				НезавершенноеПроизводство.Подразделение,
		  |				НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |				НезавершенноеПроизводство.СтатьяЗатрат,
		  |				НезавершенноеПроизводство.НоменклатураЗатрат,
		  |				СУММА(НезавершенноеПроизводство.Стоимость) КАК Стоимость,
		  |				СУММА(НезавершенноеПроизводство.НДС) КАК НДС,
		  |				СУММА(НезавершенноеПроизводство.НоменклатураЗатратКоличество) КАК НоменклатураЗатратКоличество
		  |			ИЗ
		  |				РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
		  |			ГДЕ
		  |				НезавершенноеПроизводство.Период >= &НачДата
		  |				И НезавершенноеПроизводство.Период <= &КонДата
		  |				И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
		  |				И НезавершенноеПроизводство.КодОперации <> &КодОперацииРаспределениеОПЗ
		  |				И НезавершенноеПроизводство.КодОперации <> &КодОперацииСписаниеБрак
		  |//ОТБОРНезавершенноеПроизводство
		  |
		  |			СГРУППИРОВАТЬ ПО
		  |				НезавершенноеПроизводство.Подразделение,
		  |				НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |				НезавершенноеПроизводство.СтатьяЗатрат,
		  |				НезавершенноеПроизводство.НоменклатураЗатрат
		  |	   		) КАК НЗПОборотыПриходБезОПЗ
		  |       ) КАК ПрямыеЗатраты
     	  |		ПО Выпуск.ПодразделениеВыпуска = ПрямыеЗатраты.ПодразделениеПрямыхЗатрат
     	  |			И Выпуск.НоменклатурнаяГруппаВыпуска = ПрямыеЗатраты.НоменклатурнаяГруппаПрямыхЗатрат
		  |
     	  |		ЛЕВОЕ СОЕДИНЕНИЕ 
		  |     (ВЫБРАТЬ
     	  |			НЗПОборотыПриходОПЗ.Подразделение КАК ПодразделениеОПЗ,
     	  |			НЗПОборотыПриходОПЗ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппаОПЗ,
     	  |			НЗПОборотыПриходОПЗ.СтатьяЗатрат КАК ЗатратыОПЗ,
     	  |			НЗПОборотыПриходОПЗ.Стоимость КАК СуммаОПЗ,
     	  |			НЗПОборотыПриходОПЗ.НДС КАК НДСОПЗ
     	  |		ИЗ
		  |      	(ВЫБРАТЬ 
		  |				НезавершенноеПроизводство.Подразделение,
		  |				НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |				НезавершенноеПроизводство.СтатьяЗатрат,
		  |				СУММА(НезавершенноеПроизводство.Стоимость) КАК Стоимость,
		  |				СУММА(НезавершенноеПроизводство.НДС) КАК НДС
		  |			ИЗ
		  |				РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
		  |			ГДЕ
		  |				НезавершенноеПроизводство.Период >= &НачДата
		  |				И НезавершенноеПроизводство.Период <= &КонДата
		  |				И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
		  |				И НезавершенноеПроизводство.КодОперации = &КодОперацииРаспределениеОПЗ
		  |//ОТБОРНезавершенноеПроизводство
		  |
		  |			СГРУППИРОВАТЬ ПО
		  |				НезавершенноеПроизводство.Подразделение,
		  |				НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |				НезавершенноеПроизводство.СтатьяЗатрат
		  |	   		) КАК НЗПОборотыПриходОПЗ
		  |     ) КАК ОбщеПроизводственныеЗатраты
     	  |		ПО Выпуск.ПодразделениеВыпуска = ОбщеПроизводственныеЗатраты.ПодразделениеОПЗ
     	  |			И Выпуск.НоменклатурнаяГруппаВыпуска = ОбщеПроизводственныеЗатраты.НоменклатурнаяГруппаОПЗ
		  |
     	  |		ЛЕВОЕ СОЕДИНЕНИЕ 
		  |     (ВЫБРАТЬ
     	  |			НЗПОборотыПриходБрак.Подразделение КАК ПодразделениеБрак,
     	  |			НЗПОборотыПриходБрак.НоменклатурнаяГруппа КАК НоменклатурнаяГруппаБрак,
     	  |			НЗПОборотыПриходБрак.СтатьяЗатрат КАК ЗатратыБрак,
     	  |			НЗПОборотыПриходБрак.Стоимость КАК СуммаБрак,
     	  |			НЗПОборотыПриходБрак.НДС КАК НДСБрак
     	  |		ИЗ
		  |      	(ВЫБРАТЬ 
		  |				НезавершенноеПроизводство.Подразделение,
		  |				НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |				НезавершенноеПроизводство.СтатьяЗатрат,
		  |				СУММА(НезавершенноеПроизводство.Стоимость) КАК Стоимость,
		  |				СУММА(НезавершенноеПроизводство.НДС) КАК НДС
		  |			ИЗ
		  |				РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
		  |			ГДЕ
		  |				НезавершенноеПроизводство.Период >= &НачДата
		  |				И НезавершенноеПроизводство.Период <= &КонДата
		  |				И НезавершенноеПроизводство.ВидДвижения = &ВидДвиженияПриход
		  |				И НезавершенноеПроизводство.КодОперации = &КодОперацииСписаниеБрак
		  |//ОТБОРНезавершенноеПроизводство
		  |
		  |			СГРУППИРОВАТЬ ПО
		  |				НезавершенноеПроизводство.Подразделение,
		  |				НезавершенноеПроизводство.НоменклатурнаяГруппа,
		  |				НезавершенноеПроизводство.СтатьяЗатрат
		  |	   		) КАК НЗПОборотыПриходБрак
		  |     ) КАК Брак
     	  |		ПО Выпуск.ПодразделениеВыпуска = Брак.ПодразделениеБрак
     	  |			И Выпуск.НоменклатурнаяГруппаВыпуска = Брак.НоменклатурнаяГруппаБрак
		  |
     	  |		ЛЕВОЕ СОЕДИНЕНИЕ 
		  |     (ВЫБРАТЬ
     	  |			НЗПОстаткиИОбороты.СтоимостьНачальныйОстаток КАК НачОст,
     	  |			НЗПОстаткиИОбороты.СтоимостьКонечныйОстаток КАК КонОст,
     	  |			НЗПОстаткиИОбороты.НДСНачальныйОстаток КАК НДСНачОст,
     	  |			НЗПОстаткиИОбороты.НДСКонечныйОстаток КАК НДСКонОст,
     	  |			НЗПОстаткиИОбороты.Подразделение КАК ПодразделениеНЗП,
     	  |			НЗПОстаткиИОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппаНЗП
     	  |		ИЗ
		  |			РегистрНакопления.НезавершенноеПроизводство.ОстаткиИОбороты(&НачДата, &КонДата) КАК НЗПОстаткиИОбороты
		  |     ) КАК НЗП
     	  |		ПО Выпуск.НоменклатурнаяГруппаВыпуска = НЗП.НоменклатурнаяГруппаНЗП
     	  |			И Выпуск.ПодразделениеВыпуска = НЗП.ПодразделениеНЗП
     	  |УПОРЯДОЧИТЬ ПО 
     	  |		ВЫБОР КОГДА ЕСТЬNULL(ПрямыеЗатраты.ЗатратыПрямыхЗатрат.ВидЗатрат, ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.Прочие)) = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.Материальные) ТОГДА 0 ИНАЧЕ 1 КОНЕЦ
		  |
     	  |ИТОГИ
     	  |	МАКСИМУМ(Количество),
     	  |	МАКСИМУМ(КоличествоПрямыхЗатрат),
     	  |	СУММА(ОбщаяСуммаВыпуска),
     	  |	СУММА(ОбщийНДСВыпуска),
     	  |	МАКСИМУМ(Сумма),
     	  |	МАКСИМУМ(НДС),
     	  |	МАКСИМУМ(СуммаПрямыхЗатрат),
     	  |	МАКСИМУМ(НДСПрямыхЗатрат),
     	  |	МАКСИМУМ(НачОстНЗП),
     	  |	МАКСИМУМ(КонОстНЗП),
     	  |	МАКСИМУМ(НДСНачОстНЗП),
     	  |	МАКСИМУМ(НДСКонОстНЗП),
     	  |	МАКСИМУМ(СуммаБрак),
     	  |	МАКСИМУМ(НДСБрак),
     	  |	МАКСИМУМ(СуммаОПЗ),
     	  |	МАКСИМУМ(НДСОПЗ)
     	  |ПО
     	  |	Подразделение,
     	  |	НоменклатурнаяГруппа,
     	  |	Номенклатура,
     	  |	Характеристика,
     	  |	Серия,
     	  |	Заказ,
     	  |	Качество,
     	  |	ПрямыеЗатраты,
     	  |	НоменклатураПрямыхЗатрат,
		  |	ЗатратыОПЗ,
     	  |	ЗатратыБрак
		  |";
		  
	Возврат Текст;
	
КонецФункции


Процедура ВывестиОбласть(ДокументРезультат, ОбластьОсновная, ОбластьОкончание, Уровень, ИмяГруппы, Открыта, ИмяПараметра, Выборка)
	
	Если Уровень = 0 Тогда
		ОбластьНачало = ДокументРезультат.Вывести(ОбластьОсновная);
	Иначе
		ОбластьНачало = ДокументРезультат.Вывести(ОбластьОсновная, Уровень, ИмяГруппы, Открыта);
	КонецЕсли;
	
	Если Уровень = 0 Тогда
		ОбластьКонец = ДокументРезультат.Присоединить(ОбластьОкончание);
	Иначе
		
		ОбластьКонец = ДокументРезультат.Присоединить(ОбластьОкончание, Уровень, ИмяГруппы, Открыта);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт

	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода  = КонецДня(ДатаКон);

	ДокументРезультат.Очистить();

	Макет      = ПолучитьМакет("Отчет");
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
    МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
	// 37490 <<
	МакетОбщий.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>	

	ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
	
	ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "ФП = Истина");
	ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецДня(ДатаКон);
	ЗаголовокОтчета.Параметры.НазваниеОтчета      = НСтр("ru='Калькуляция себестоимости продукции (управленческий учет)';uk='Калькуляція собівартості продукції (управлінський облік)'", КодЯзыкаПечать);
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
	
	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	Запрос = Новый Запрос;
	// Запрос.УстановитьПараметр("НачДата",     			Новый Граница(НачалоДня(ДатаНач), ВидГраницы.Включая));
	// Запрос.УстановитьПараметр("КонДата",     			Новый Граница(КонецДня(ДатаКон),  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачДата",     			НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("КонДата",     			КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ВидДвиженияПриход",     	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",     	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("КодОперацииРаспределениеОПЗ", Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеОбщепроизводственныеРасходы_Регламент);
	Запрос.УстановитьПараметр("КодОперацииСписаниеБрак", Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеБракВПроизводстве_Регламент);
	
	ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
	ОграниченияПоПостроителюОтчетаНЗП = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчетаСПрефиксом(ПостроительОтчета, Запрос, "НезавершенноеПроизводство.");
	
	Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчетаНЗП) Тогда
		ОграниченияПоПостроителюОтчетаНЗП = " И " + ОграниченияПоПостроителюОтчетаНЗП;
	КонецЕсли;
	
	
	ЗапросТекст = СформироватьТекстЗапроса();
	
	ЗапросТекст  = СтрЗаменить(ЗапросТекст, ") КАК НЗПОстаткиИОбороты", ",,," + ОграниченияПоПостроителюОтчета + ") КАК НЗПОстаткиИОбороты");
	ЗапросТекст  = СтрЗаменить(ЗапросТекст, "//ОТБОРНезавершенноеПроизводство", "" + ОграниченияПоПостроителюОтчетаНЗП + " ");
	
	Запрос.Текст = ЗапросТекст;
	
	Результат = Запрос.Выполнить();
	
	СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
	Если Не ПустаяСтрока(СтрОтбор) Тогда
		ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");                     
		ОбластьОтбор.Параметры.ТекстПроОтбор = "Отбор: " + СтрОтбор;
		ДокументРезультат.Вывести(ОбластьОтбор);
	КонецЕсли;	
	
	ОбластьШапка              = Макет.ПолучитьОбласть("Шапка|Основная");
	ОбластьСтрокаЗатрат       = Макет.ПолучитьОбласть("СтрокаЗатрат|Основная");
	ОбластьСчетЗатрат         = Макет.ПолучитьОбласть("СчетЗатрат|Основная");
	ОбластьНоменклатураЗатрат = Макет.ПолучитьОбласть("СтрокаНоменклатурыЗатрат|Основная");
	
	ОбластьШапка23            = Макет.ПолучитьОбласть("Шапка23|Основная");
	ОбластьШапка91            = Макет.ПолучитьОбласть("Шапка91|Основная");
	ОбластьШапка24            = Макет.ПолучитьОбласть("Шапка24|Основная");
	ОбластьИтого23            = Макет.ПолучитьОбласть("Итого23|Основная");
	ОбластьИтого91            = Макет.ПолучитьОбласть("Итого91|Основная");
	ОбластьИтого24            = Макет.ПолучитьОбласть("Итого24|Основная");
	ОбластьНЗПНач             = Макет.ПолучитьОбласть("НЗПНач|Основная");
	ОбластьНЗПКон             = Макет.ПолучитьОбласть("НЗПКон|Основная");
	ОбластьНЗПИтого           = Макет.ПолучитьОбласть("НЗПИтого|Основная");
	ОбластьОкончаниеТаблицы   = Макет.ПолучитьОбласть("ОкончаниеТаблицы|Основная");
	ОбластьШапкаОкончание              = Макет.ПолучитьОбласть("Шапка|Окончание");
	ОбластьСтрокаЗатратОкончание       = Макет.ПолучитьОбласть("СтрокаЗатрат|Окончание");
	ОбластьСчетЗатратОкончание         = Макет.ПолучитьОбласть("СчетЗатрат|Окончание");
	ОбластьНоменклатураЗатратОкончание = Макет.ПолучитьОбласть("СтрокаНоменклатурыЗатрат|Окончание");
	ОбластьШапка23Окончание            = Макет.ПолучитьОбласть("Шапка23|Окончание");
	ОбластьШапка91Окончание            = Макет.ПолучитьОбласть("Шапка91|Окончание");
	ОбластьШапка24Окончание            = Макет.ПолучитьОбласть("Шапка24|Окончание");
	ОбластьИтого23Окончание            = Макет.ПолучитьОбласть("Итого23|Окончание");
	ОбластьИтого91Окончание            = Макет.ПолучитьОбласть("Итого91|Окончание");
	ОбластьИтого24Окончание            = Макет.ПолучитьОбласть("Итого24|Окончание");
	ОбластьНЗПНачОкончание             = Макет.ПолучитьОбласть("НЗПНач|Окончание");
	ОбластьНЗПКонОкончание             = Макет.ПолучитьОбласть("НЗПКон|Окончание");
	ОбластьНЗПИтогоОкончание           = Макет.ПолучитьОбласть("НЗПИтого|Окончание");
	ОбластьОкончаниеТаблицыОкончание   = Макет.ПолучитьОбласть("ОкончаниеТаблицы|Окончание");
	
	ОбластьПодвал             = МакетОбщий.ПолучитьОбласть("Подвал");
	
	ВыборкаПодразделение = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	
	Пока ВыборкаПодразделение.Следующий() Цикл		
		ВыборкаНоменклатурнаяГруппа = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатурнаяГруппа");
		
		Пока ВыборкаНоменклатурнаяГруппа.Следующий() Цикл
			
			ВсегоВыпуск = ВыборкаНоменклатурнаяГруппа.ОбщаяСуммаВыпуска + ВыборкаНоменклатурнаяГруппа.ОбщийНДСВыпуска;
			Если ВсегоВыпуск = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаНоменклатураВыпуска = ВыборкаНоменклатурнаяГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
			
			Пока ВыборкаНоменклатураВыпуска.Следующий() Цикл
				
			ВыборкаХарактеристикаВыпуска = ВыборкаНоменклатураВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Характеристика");
			Пока ВыборкаХарактеристикаВыпуска.Следующий() Цикл
			ВыборкаСерияВыпуска = ВыборкаХарактеристикаВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Серия");
			Пока ВыборкаСерияВыпуска.Следующий() Цикл
			ВыборкаЗаказВыпуска = ВыборкаСерияВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Заказ");
			Пока ВыборкаЗаказВыпуска.Следующий() Цикл
			ВыборкаКачествоВыпуска = ВыборкаЗаказВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Качество");
			Пока ВыборкаКачествоВыпуска.Следующий() Цикл
				
				Если НЕ ЗначениеЗаполнено(ВыборкаКачествоВыпуска.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаВыпуска   = ВыборкаКачествоВыпуска.ОбщаяСуммаВыпуска + ВыборкаКачествоВыпуска.ОбщийНДСВыпуска;
				
				Если СуммаВыпуска = 0  Тогда
					Продолжить;
				КонецЕсли;
				
				Коэффициент   = ?(ВсегоВыпуск = 0, 0, СуммаВыпуска  / ВсегоВыпуск);
								
				ОбластьШапка.Параметры.НоменклатураВыпуска         = УправлениеПроизводством.ВыводНаименованияВыпуска(ВыборкаКачествоВыпуска.Номенклатура, Истина, ВыборкаКачествоВыпуска.Характеристика, ВыборкаКачествоВыпуска.Серия, ВыборкаКачествоВыпуска.Заказ, ВыборкаКачествоВыпуска.Качество);
				ОбластьШапка.Параметры.АналитикаВыпуска            = "" + ВыборкаКачествоВыпуска.Подразделение + " / " + ВыборкаКачествоВыпуска.НоменклатурнаяГруппа;
				ОбластьШапка.Параметры.КоличествоВыпуска           = ВыборкаКачествоВыпуска.Количество;
				ОбластьШапка.Параметры.СуммаВыпуска                =  ?(ВыборкаКачествоВыпуска.Количество = 0, 0, ВыборкаКачествоВыпуска.Сумма+ВыборкаКачествоВыпуска.НДС);
				ОбластьШапка.Параметры.ЦенаВыпуска                 = ?(ВыборкаКачествоВыпуска.Количество = 0, ВыборкаКачествоВыпуска.Сумма+ВыборкаКачествоВыпуска.НДС, (ВыборкаКачествоВыпуска.Сумма+ВыборкаКачествоВыпуска.НДС)/ВыборкаКачествоВыпуска.Количество);
				ОбластьШапка.Параметры.ТекстКоличество             = ?(ВыборкаКачествоВыпуска.Количество = 0, "", НСтр("ru='Количество выпуска:';uk='Кількість випуску:'", КодЯзыкаПечать));
				ОбластьШапка.Параметры.ТекстСумма                  = ?(ВыборкаКачествоВыпуска.Количество = 0, "", НСтр("ru='Факт. стоимость выпуска:';uk='Факт. вартість випуску:'", КодЯзыкаПечать));
				ОбластьШапка.Параметры.СебестоимостьЕдиницы        = НСтр("ru='Себестоимость ед.';uk='Собівартість од.'", КодЯзыкаПечать);
                ВывестиОбласть(ДокументРезультат, ОбластьШапка, ОбластьШапкаОкончание, 1, "Группа1", Ложь, "Сумма", ВыборкаКачествоВыпуска);

                ВывестиОбласть(ДокументРезультат, ОбластьШапка23, ОбластьШапка23Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаКачествоВыпуска);
				ВыборкаПрямыеЗатраты = ВыборкаКачествоВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПрямыеЗатраты");
				
				ИтогоСуммаЗатрат23 = 0;
				
				Пока ВыборкаПрямыеЗатраты.Следующий() Цикл
					
					Если ВыборкаПрямыеЗатраты.СуммаПрямыхЗатрат+ВыборкаПрямыеЗатраты.НДСПрямыхЗатрат = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ВыборкаНоменклатураЗатрат = ВыборкаПрямыеЗатраты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
					СуммаПрямыхЗатрат   = 0;
					Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
						СуммаПрямыхЗатрат = СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.НДСПрямыхЗатрат;
					КонецЦикла;
					
					ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = ВыборкаПрямыеЗатраты.ПрямыеЗатраты;
					ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат = СуммаПрямыхЗатрат * Коэффициент;
                    ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 2, "Группа2", Ложь, "СуммаЗатрат", ВыборкаПрямыеЗатраты);
					
					ВыборкаНоменклатураЗатрат = ВыборкаПрямыеЗатраты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
					
					МатериальныеЗатраты = (ВыборкаПрямыеЗатраты.МатериальныеЗатраты = 0);
					
					Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
						
						ОбластьНоменклатураЗатрат.Параметры.НаименованиеНоменклатурыЗатрат = УправлениеПроизводством.ВыводНоменклатурыЗатрат(ВыборкаНоменклатураЗатрат.НоменклатураПрямыхЗатрат);
						ОбластьНоменклатураЗатрат.Параметры.СуммаНоменклатурыЗатрат        = (ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.НДСПрямыхЗатрат) * Коэффициент;
						ОбластьНоменклатураЗатрат.Параметры.КоличествоНоменклатурыЗатрат   = ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат * Коэффициент;
						ОбластьНоменклатураЗатрат.Параметры.ЦенаНоменклатурыЗатрат         = ?(ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат = 0, 0, (ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат+ВыборкаНоменклатураЗатрат.НДСПрямыхЗатрат)/ ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат);
						Если МатериальныеЗатраты Тогда
							ВывестиОбласть(ДокументРезультат, ОбластьНоменклатураЗатрат, ОбластьНоменклатураЗатратОкончание, 3, "Группа3", Ложь, "СуммаНоменклатурыЗатрат", ВыборкаНоменклатураЗатрат);	
						КонецЕсли; 
						
						ИтогоСуммаЗатрат23 = ИтогоСуммаЗатрат23 + (ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.НДСПрямыхЗатрат) * Коэффициент;
						
					КонецЦикла; // НоменклатураЗатрат
						
				КонецЦикла;  // ПрямыеЗатраты
				
				ОбластьИтого23.Параметры.ИтогоСуммаЗатрат23 = ИтогоСуммаЗатрат23;
			    ВывестиОбласть(ДокументРезультат, ОбластьИтого23, ОбластьИтого23Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат23", ВыборкаПрямыеЗатраты);
				
				Всего91 = ВыборкаКачествоВыпуска.СуммаОПЗ + ВыборкаКачествоВыпуска.НДСОПЗ;
				ВсегоСуммаЗатрат = 0;
				Если НЕ Всего91 = 0 Тогда
			        ВывестиОбласть(ДокументРезультат, ОбластьШапка91, ОбластьШапка91Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаКачествоВыпуска);
					Выборка91 = ВыборкаКачествоВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗатратыОПЗ");
					Пока Выборка91.Следующий() Цикл
						ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = Выборка91.ЗатратыОПЗ;
						ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат        = (Выборка91.СуммаОПЗ+Выборка91.НДСОПЗ) * Коэффициент;
						ВсегоСуммаЗатрат = ВсегоСуммаЗатрат + (Выборка91.СуммаОПЗ+Выборка91.НДСОПЗ) * Коэффициент;
                        ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 0, 0, Ложь, "СуммаЗатрат", Выборка91);
					КонецЦикла; 					
					ОбластьИтого91.Параметры.ИтогоСуммаЗатрат91        = ВсегоСуммаЗатрат;
			        ВывестиОбласть(ДокументРезультат, ОбластьИтого91, ОбластьИтого91Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат91", Выборка91);
				КонецЕсли;  // Затраты91
				
				Всего24 = ВыборкаКачествоВыпуска.СуммаБрак + ВыборкаКачествоВыпуска.НДСБрак;
				ВсегоСуммаЗатрат = 0;
				Если НЕ Всего24 = 0 Тогда
			        ВывестиОбласть(ДокументРезультат, ОбластьШапка24, ОбластьШапка24Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаКачествоВыпуска);
					Выборка24 = ВыборкаКачествоВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗатратыБрак");
					Пока Выборка24.Следующий() Цикл
						ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = Выборка24.ЗатратыБрак;
						ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат        = (Выборка24.СуммаБрак+Выборка24.НДСБрак) * Коэффициент;
						ВсегоСуммаЗатрат = ВсегоСуммаЗатрат + (Выборка24.СуммаБрак+Выборка24.НДСБрак) * Коэффициент;
                        ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 0, 0, Ложь, "СуммаЗатрат", Выборка24);
					КонецЦикла; 					
					ОбластьИтого24.Параметры.ИтогоСуммаЗатрат24        = ВсегоСуммаЗатрат;
			        ВывестиОбласть(ДокументРезультат, ОбластьИтого24, ОбластьИтого24Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат24", Выборка24);
		   		КонецЕсли;  // Затраты24
				
				
				НачОстНЗП   = (ВыборкаКачествоВыпуска.НачОстНЗП + ВыборкаКачествоВыпуска.НДСНачОстНЗП)  * Коэффициент;
				КонОстНЗП   = (ВыборкаКачествоВыпуска.КонОстНЗП + ВыборкаКачествоВыпуска.НДСКонОстНЗП)  * Коэффициент;
				
				Если НачОстНЗП <> 0 ИЛИ КонОстНЗП <> 0 Тогда
					   
					ОбластьНЗПНач.Параметры.СуммаНЗПнаНачало = НачОстНЗП;
					ОбластьНЗПКон.Параметры.СуммаНЗПнаКонец  = КонОстНЗП;
					ОбластьНЗПИтого.Параметры.ИтогоНЗП         = НачОстНЗП - КонОстНЗП;
					ОбластьНЗПНач.Параметры.НачалоПериода	  = ДатаНач;
					ОбластьНЗПКон.Параметры.КонецПериода	  =	ДатаКон;
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПНач,  ОбластьНЗПНачОкончание, 2, "Группа2", Ложь, "НачОстНЗП", ВыборкаКачествоВыпуска);
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПКон,  ОбластьНЗПКонОкончание, 2, "Группа2", Ложь, "КонОстНЗП", ВыборкаКачествоВыпуска);
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПИтого, ОбластьНЗПИтогоОкончание, 2, "Группа2", Ложь, "ИтогоНЗП", ВыборкаКачествоВыпуска);
				КонецЕсли;  // НЗП
				
			    ВывестиОбласть(ДокументРезультат, ОбластьОкончаниеТаблицы,  ОбластьОкончаниеТаблицыОкончание, 1, "Группа1", Ложь, "Текст", ВыборкаКачествоВыпуска);
				
			КонецЦикла;  // КачествоВыпуска	
			КонецЦикла;  // ЗаказВыпуска	
			КонецЦикла;  // СерияВыпуска	
			КонецЦикла;  // ХарактеристикаВыпуска	
			КонецЦикла;  // НоменклатураВыпуска

		КонецЦикла;   // НоменклатурнаяГруппа
	КонецЦикла;    // Подразделение
	
	ОбластьПодвал.Параметры.ТекстПримечания = "";

	ДокументРезультат.Вывести(ОбластьПодвал);
	
	ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
	
	ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
	
	// Зафиксируем заголовок отчета
	ДокументРезультат.ФиксацияСверху = ВысотаЗаголовка + 1;

	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы-1);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Калькуляция себестоимости (упр. учет)';uk='Калькуляція собівартості (упр. облік)'");

	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры // СформироватьОтчет

Функция РазъяснитьЗатраты(СчетЗатрат) //не есть ошибкой проверки конфигурации
	
 	    СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПоставщиками;
 		ПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();


	Если СчетЗатрат = ПустойСчет Тогда
		Возврат "";
	КонецЕсли;
	
	Если СчетЗатрат.ПринадлежитЭлементу(СчетУчетаРасчетов)
		Или СчетЗатрат.ПринадлежитЭлементу(СчетУчетаРасчетов)Тогда
		Возврат "Услуги сторонних организаций"
	Иначе
		Возврат СчетЗатрат.Наименование;
	КонецЕсли;
  
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
